{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":7,"edges":[{"node":{"num":7,"title":"Homegrown JavaScript","on":"20101109","speakers":[{"title":"Better form validation with jQuery.validationEngine","name":"Cedric Dugas","url":"http://www.position-absolute.com/","email":"cedric.dugas@gmail.com","synopsis":"Form validation is an annoying, repetitive task that we all hate to do. Cedric's jQuery plugin makes form validation much less painful."},{"title":"Webshell - A console based Javascripty web client utility","name":"Sean Coates","url":"http://seancoates.com/blogs/","email":"sean@seancoates.com","synopsis":"Sean Coates is a name that is familiar with the PHP community but tonight he's gonna show Webshell, a web client utility written using NodeJS."}],"blurb":"We all know the benefits of eating and buying local products. As I sat in <i>cosmic reflexion</i>, it occured to me: Why not apply this ecologically sound point of view to the code we use?  This month we're looking at things you can use in your everyday coding, developped locally. <b>There are more spots, contact us!</b>"}},{"node":{"num":6,"title":"Statechart to ECMAScript, Real-time apps with CouchDB","on":"20100914","speakers":[{"title":"Developing a statechart to ECMAScript compiler","name":"Jacob Beard","url":"http://blog.echo-flow.com/","email":"jbeard4@cs.mcgill.ca","synopsis":"Developing rich, Web-based user interfaces can be challenging due to the complex behavioural relationships between UI components, which are often difficult to express, and are even more difficult to encode and maintain. An elegant solution may be found in Model-Driven Engineering. In particular, Statecharts, a formalism for describing complex, reactive, timed, state-based behaviour, is highly suited to model UI behaviour. This presentation will discuss the SCXML JavaScript Code Generation Framework (scxml-js), a Statechart-to-JavaScript compiler, and how it may be used to accelerate the development of fast, robust, and richly interactive Web-based UIs"},{"title":"Building real-time web applications with CouchDB","name":"Alexis Sellier","url":"http://cloudhead.io/","email":"alexis@cloudhead.net","synopsis":"Alexis is going to introduce <a href=\"http://couchdb.org\">CouchDB</a> and explain how he's been using it to create real-time web applications."}],"blurb":"After a short hiatus we return with two great presentations. Jacob is back from <a href=\"http://svgopen.org/2010/\">SVG Open 2010</a> in Paris to tell us more about his SCXML -> JavaScript compiler. Alexis will be doing his second presentation for JS-MTL on the subject of CouchDB and real-time web applications.  <a href=\"http://js-montreal.org/map\">See you there!</a>"}},{"node":{"num":5,"title":"Spring is the new summer","on":"20100713","speakers":[{"title":"Why Software Sucks, JavaScript and you","name":"James Duncan","url":"http://joyent.com","email":"james@joyent.com","synopsis":"Why does software suck? James Duncan is going to tackle this age-old question and tell us why <i>JavaScript is the last language you'll ever need to know</i>. He is currently developing a PaaS using end to end JavaScript called SmartPlatform."},{"title":"A Quilt Of Higher-Order Functions","name":"Laurent Villeneuve","url":"http://github.com/mazesoul","email":"mazesoul@gmail.com","synopsis":"A machine-gun delivered overview of functional <a title=\"AIIIIYA\" href=\"http://en.wikipedia.org/wiki/Jutsu\">jutsu</a>."}],"blurb":null}},{"node":{"num":4,"title":"Function the Ultimate","on":"20100511","speakers":[{"title":"Partial application in JavaScript","name":"Sean Braithwaite","url":"http://twitter.com/brapse","email":"brapse@gmail.com","synopsis":"Partial function application is a staple of functional programming. It is easily implemented in JavaScript as Sean will show us."},{"title":"Continuation-passing style in JavaScript","name":"Vladimir Sedach","url":"http://carcaddar.blogspot.com/","email":"vsedach@gmail.com","synopsis":"Vladimir will demonstrate how to use this technique to compile search queries."}],"blurb":null}},{"node":{"num":3,"title":"Node JS: An introduction","on":"20100413","speakers":[{"title":"Node JS: An introduction","name":"Alexis Sellier","url":"http://cloudhead.io/","email":"alexis@cloudhead.net","synopsis":"Node JS is an evented IO framework built on top of V8 Javascript. It's particularly useful for building http-based servers and JavaScript is a great match for event-based programming. Alexis has been playing with it for a while and will get us up to speed."},{"title":"Since we last met...","name":"Bruno Carriere","url":"http://js-montreal.org","email":"neonskimmer@gmail.com","synopsis":"An overview of what happened since our last meeting, in February."}],"blurb":null}},{"node":{"num":2,"title":"Plugins In Your Web App: The How-To","on":"20100210","speakers":[{"title":"Plugins In Your Web App: The How-To","name":"Gary Haran","url":"http://talkerapp.com","email":"gary.haran@gmail.com","synopsis":"A plugin based architecture is a great way to build extensible web applications. Gary takes us through the basics and tells us more about his group chat application, Talker."}],"blurb":null}},{"node":{"num":1,"title":"Inaugural meetup!","on":"20100121","speakers":[{"title":"A brief history of JavaScript","name":"Bruno Carriere","url":"http://js-montreal.org","email":"neonskimmer@gmail.com","synopsis":"The JavaScript language has had a very interesting history. Despite being a young language, it has become the most popular one on the planet and its story is one full of mystery, intrigue and murder! Ok maybe not."},{"title":"Building a DSL for RESTful applications in JavaScript","name":"Laurent Villeneuve","url":"http://github.com/mazesoul","email":"mazesoul@gmail.com","synopsis":"Laurent presents a useful abstraction created to define a RESTful application's URL routes. The idea continues now on github with his <a href=\"http://github.com/mazesoul/restate\">restate</a> project."}],"blurb":null}}]}},"pageContext":{"year":2010,"yearRegex":"/^2010/"}}