{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":10,"edges":[{"node":{"num":26,"title":"Going native","on":"20121211","speakers":[{"title":"Introduction a Appcelerator Titanium","name":"Florent Lamoureux","url":"http://www.florentlamoureux.fr/","email":"lamoureux.florent@gmail.com","synopsis":"Titanium est un framework open source JavaScript, maintenu par Appcelerator, qui permet de développer des applications natives multi plateformes à partir d'un même code source. Florent va présenter son principe de fonctionnement, atouts et inconvénients, et nous montrera en direct la création d'une petite application multi plateforme."}],"blurb":"Building native mobile applications (not embedded browser applications) for multiple platforms, in JavaScript? Totally possible."}},{"node":{"num":25,"title":"Enyo 2 + Blanket.js","on":"20121113","speakers":[{"title":"Introducing the Enyo 2.0 framework","name":"Olafur Arason","url":"https://github.com/olafura","email":"olafura@olafura.com","synopsis":"Enyo 2 is a new component based JavaScript framework. It promotes a sane structure for the code and is easy to get into to make powerful applications. Olafur will also discuss his project DataControl which integrates PouchDB into Enyo to provide a seamless experience when working in offline conditions."},{"title":"Seamless code coverage with Blanket.js","name":"Alex Seville","url":"https://github.com/alex-seville","email":"hi@alexanderseville.com","synopsis":"Blanket.js is a new open source code coverage tool for JavaScript. Currently in alpha release, it completely changes how code coverage is managed in JavaScript testing. Alex will discuss current techniques for JavaScript code coverage and the method used by Blanket.js."}],"blurb":"Building complex web applications these days presents us a with a myriad of options. Rich, component based frameworks are one option and Enyo 2 is one of them. But you also need good tests! Discover code coverage tool Blanket.js."}},{"node":{"num":24,"title":"JS-MONTREAL #24","on":"20121009","speakers":[{"title":"Taking Javascript Into The Field: A case study","name":"Gina Cook & Theresa Deering","url":"https://github.com/OpenSourceFieldlinguistics","email":"gina.c.cook@gmail.com","synopsis":"FieldDB is a 100% Javascript stack for collaboratively collecting data. It was designed to run offline on multiple platforms (Chrome Extension and Android). In this talk we will discuss the hurdles along the way to building a data heavy offline app. We will focus two key libraries and how they fit into our stack: PouchDB alpha, a Javascript implementation of the NoSQL database CouchDB, for storing large amounts of data offline, and Require.js for simplifying development and deploying to different targets. The Javascript App, and its Node.js web services are <a  href=\"https://github.com/OpenSourceFieldlinguistics\">OpenSourced on GitHub</a>"}],"blurb":"This month we explore another, lesser known context for JavaScript applications - in the browser but completely offline, in the field."}},{"node":{"num":23,"title":"JS-MONTREAL #23","on":"20120911","speakers":[{"title":"Next-generation JavaScript Frameworks","name":"Clarence Leung","url":"https://github.com/clarle","email":"cleung0@gmail.com","synopsis":"Now that we have both client-side and server-side JavaScript frameworks, the next step is to bring the two together. Clarence will explain the benefits of sharing code between client and server and demo three of the newest frameworks that take advantage of this: Mojito, Derby and Meteor."}],"blurb":""}},{"node":{"num":22,"title":"JS-MONTREAL #22","on":"20120814","speakers":[{"title":"Building assets on the fly with Node","name":"Martin Drapeau","url":"https://github.com/martindrapeau","email":"martindrapeau@gmail.com","synopsis":"Martin is going to demonstrate the technique he has been using to serve assets and templates without a 'watcher', using Node and Snockets."},{"title":"JavaScript Tools and Frameworks Faves","name":"Anna Filina","url":"http://annafilina.com","email":"afilina@gmail.com","synopsis":"Anna will pick a few Javascript frameworks and libraries that she used on a recent project (jQuery, RaphaelJS, Plupload, etc.). And then show a quick overview of the possibilities of each and how they helped her build a mission-critical application."}],"blurb":"After a great Node meetup, here's more cool stuff you can do with it. Also: JavaScript library favorites. I assure you there is an air conditioner where we meet."}},{"node":{"num":21,"title":"Jump into Node - Part 2","on":"20120710","speakers":[{"title":"Getting to know Node","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"Steve's going to show us how to get started building web apps using Node, Express and Jade. We'll also see explore some of the tools useful for Node development and a demonstration of Node's asynchronous nature through a small crawler program Steve has built. Exceptionally this month, there will be only one presentation because there is a lot of material to cover. And plenty of time for questions."}],"blurb":"This month it's all about Node. If you still haven't had the chance to build something with Node, this month's presentation will be a good introduction to everything you need to know to get started. Node is no longer on the fringe. With the support and endorsement of giants like Microsoft, Yahoo, eBay, Joyent, LinkedIn - Node's time to hit the mainstream is imminent. Come see what all the fuss is about and leave with enough knowledge to hit the ground running."}},{"node":{"num":20,"title":"JS-MONTREAL #20","on":"20120508","speakers":[{"title":"QML - QT programs with JavaScript","name":"Rahul Garg","url":"http://twitter.com/#!/codedivine","email":"rahulgarg44@gmail.com","synopsis":"QML is a JavaScript-based, declarative language for designing user interface–centric applications. It is part of Qt Quick, the UI creation kit developed by Nokia within the Qt framework. QML is mainly used for mobile applications where touch input, fluid animations (60 FPS) and user experience are crucial. Rahul will show us how to get started with QML."},{"title":"Show and tell","name":"Everyone","url":"http://js-montreal.org","email":"neonskimmer@gmail.com","synopsis":"Let's have an open show-and-tell about tools and libraries we've recently discovered or started using."}],"blurb":"Following our month off, here's an interesting presentation about QML, another place where your JS skills can be put to work. Since we only have one presentation this month, think of some libraries or tools you've discovered recently that you want to share with the group. See you all there!"}},{"node":{"num":19,"title":"JS-MONTREAL #19","on":"20120313","speakers":[{"title":"Transform data into magic with D3","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"D3 applies data-driven transformation to a document. It is particularly adept at creating awesome visualisations using SVG and CSS3-transforms.Steve will show us how to get started with D3 and a few fun things you can do with it."},{"title":"Continuous integration for your  projects using Travis CI","name":"Christian Joudrey","url":"http://christianjoudrey.com/","email":"cmallette@gmail.com","synopsis":"Travis CI is getting a lot of traction, particularly on Github where it is beautifully integrated. Christian will explain how easy it is to get your open-source project working with Travis."}],"blurb":"Two excellent talks this month. D3 is a fascinating data transformation library and Travis CI is the hottest thing to hit the Continuous Integration scene in years. Plus, it's much prettier than Jenkins."}},{"node":{"num":18,"title":"function forever(){ return 'alone' }","on":"20120214","speakers":[{"title":" /^[FfC](?:(?:re?a|\\*{1,2}|.*)c?)king$/ Regex","name":"Laurent Villeneuve","url":"https://github.com/mazesoul","email":"mazesoul@gmail.com","synopsis":"Do you, like most regular folks, suck at regular expressions?  What if you <a href=\"http://xkcd.com/208/\">suddenly had to save someone's life</a> using Regex? You could be a hero! Laurent's going to unlock the mysteries of Regex syntax and put us all on the path to regular expression enlightenment."},{"title":"Building DocumentUp","name":"Jerome Gravel-Niquet","url":"http://jgn.me/","email":"jeromegn@gmail.com","synopsis":"Jerome's latest project, DocumentUp, uses many interesting js libraries and techniques to create documentation on the fly for your GitHub projects. He's going to tell us more about the technology behind DocumentUp: Ender, localStorage, Node and more."}],"blurb":"Yeah, we know it's on Valentine's day. Show your love for the world's most misunderstood programming language."}},{"node":{"num":17,"title":"Fulfilling your 2012 coding resolutions","on":"20120110","speakers":[{"title":"Setting up your New Years Resolution:  JsTestDriver Part 1","name":"Gina Cook","url":"http://ilanguage.ca/","email":"gina.c.cook@gmail.com","synopsis":"Getting JsTestDriver set up requires reading almost every issue in the issue tracker but it's worth it. Gina will present her findings to us and help us fullfil our testing resolutions. JsTestDriver is a test runner for Javascript unit tests that supports 3rd party frameworks."},{"title":"Readability through code formatting, idioms and compression tolerance","name":"Laurent Villeneuve","url":"http://e-signlive.com/","email":"mazesoul@gmail.com","synopsis":"After fiddling with code formatting for many years, Laurent will share some aspects of his idiosyncratic JS style. From comma-in-front formatting, to compression tolerance, to the elimination of flow control statement, we'll see how code can be transmuted to data for better scanability and eventually, architecture."}],"blurb":""}}]}},"pageContext":{"year":2012,"yearRegex":"/^2012/"}}