{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":12,"edges":[{"node":{"num":70,"title":"2016 in Summary","on":"20161213","speakers":[{"title":"Hacking on Node for fun and profit","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"We all use Node.js as a platform to run our servers, clients, bots, quick and dirty shell scripts and many other things. But few crack open Node itself and peek under the hood. No more! We're going to look at some key architecture concepts, Node's code layout, some cool hacks that can be easily done in an afternoon and finally work out how to writing native addons."}],"blurb":"Join us for a review of an amazing year of Javascript and a little exploration of Node's internals."}},{"node":{"num":69,"title":"React Native, 3D","on":"20161108","speakers":[{"title":"Introduction to React Native","name":"Rami Sayar","url":"https://ramisayar.com/","email":"rami.sayar@microsoft.com","synopsis":"React has been named the front-end library to learn in 2016! React Native has also picked up tremendous steam as a way to build cross-platform apps with React. In this talk, Rami will do a quick 5 minute introduction to React's core concepts. Following, Rami will introduce React Native, discuss the differences between React & React Native, and show you how to build a simple Android application. By the end of this talk, you will have a greater grasp of the ecosystem and leave with new tools in your developer arsenal.<br><br><i><a href='https://twitter.com/ramisayar'>Rami</a> is a Senior Technical Evangelist at Microsoft Canada</i>"},{"title":"3D on the Web","name":"Denis Grigor","url":"https://github.com/apprentice3d","email":"denis.grigor@autodesk.com","synopsis":"The Web was always flat and all efforts to use effects and some interactivity to mimic a new dimension to the Web is commendable, but not always enough. The relative recent possibility of exposing the power of the graphics cards to the browsers, opened a new door and now allows to transform the flat Web into a 3D Web. Ranging from the raw WebGL, to free and commercial 3D viewers - let us explore why it might be the next big thing."}],"blurb":"The Javascript invasion continues: Native applications and 3D"}},{"node":{"num":68,"title":"","on":"20161011","speakers":[{"title":"Building a faceted catalog of video game assets using ExtJS and Elasticsearch","name":"Karim Besbes","url":"karim.besbes@ubisoft.com","email":"karim.besbes@ubisoft.com","synopsis":"At the Ubisoft Technology Group we have created a platform for video game productions to share game assets, in-game footage and animations across the entire company. Ease of search and good UX were incredibly important for an audience of artists and creative types. This is where the Web and a powerful Javascript framework comes in; we chose ExtJS for its robustness and scalability. In this session, we will showcase two different applications and dive into the technical aspects of designing the UI for a faceted search based on Elasticsearch."}],"blurb":"Let's take a drive through Javascript, the frameworks are turning beautiful colors this time of year."}},{"node":{"num":67,"title":"","on":"20160913","speakers":[{"title":"The Node Cluster API, what is it good for?","name":"Michael Sanford","url":"michaelsanford0@gmail.com","email":"michaelsanford0@gmail.com","synopsis":"Michael will tell us about, and dismistify the secrets of multi-threaded Javascript. The Node cluster module is a prime tool and example for show casing the capabilities of modern Javascript and NodeJS."},{"title":"All about SOAJS","name":"Alain Gaeremynck","url":"alain.gaeremynck@pj.ca","email":"alain.gaeremynck@pj.ca","synopsis":"Soajs (soajs.org) is both a micro service framework and a operation management platform that sits on top of Node js for application development and on top of dockers and Kubernetes for deployment management.  Out of the box it provides mapping for input parameter validation, response building and error management.  On the operation side it allows automated deployment, service discovery and calling. Alain is going to tell us all about it."}],"blurb":"Autumn is here, it's time for hoodies, comfy jackets and long sleeves. Javascript makes for a great blanket."}},{"node":{"num":66,"title":"Global Javascript","on":"20160809","speakers":[{"title":"Building data-driven React applications with Relay & GraphQL","name":"Marc-Andre Giroux","url":"http://mgiroux.me","email":"mgiroux0@gmail.com","synopsis":"React has proven itself as a really powerful way to build complex user interfaces by using declarative and predictive components. But what about data-fetching? Relay is a JavaScript framework for building data-driven React applications. It makes data fetching simple for developers by co-locating your React components with their data needs, fetching and handling data using a powerful query language, GraphQL."},{"title":"An Overview of the React Ecosystem","name":"Rami Sayar","url":"http://twitter.com/ramisayar","email":"rami.sayar@microsoft.com","synopsis":"React has been named the front-end library to learn in 2016 however few people talk about the React without mentioning Flux (or Redux or React Native or Relay). In this talk, we will explore the ecosystem of tools and libraries that surround React. We will look at the various Flux implementations (including a short explanation of Flux) like Redux, at some of the React routing libraries, at some of the reactive database or reactive API libraries and finally at everyday tools and techniques that make the React developer happy. By the end of this talk, you will have a greater grasp of the ecosystem and leave with new tools in your developer arsenal.<br><br><i>Rami is a Senior Technical Evangelist at Microsoft Canada</i>"}],"blurb":"Looks like global warming is a thing. Maybe JavaScript can help?"}},{"node":{"num":65,"title":"Vues and Unix Pipes, what do they have in common?","on":"20160713","speakers":[{"title":"How to be super agile with Vue.js + Hype","name":"Alexandre Geissmann","url":"http://lichencommunications.com","email":"ageissmann@lichencommunications.com","synopsis":"Discover how to build amazing and flexible webapps using Vue.js and Hype. This speech will introduce an unusual workflow to quickly get running some apps, in a small-team context. We’ll also be speaking of production pipeline and requirements (such as timeframe, team communication, client, etc;), how they’re shaping the way we build the Web, and how to code javascript to embrace this purpose."},{"title":"iPipeTo -- Story of a Unix Pipe","name":"Ruy Adorno","url":"http://ruyadorno.com","email":"ruyadorno@gmail.com","synopsis":"Ruy will tell us the story of how he spiced boring old Unix pipes into a wonder of modern command line foo, with his tool iPipeTo."}],"blurb":"Join us for another edition of js-montreal with Lichen on Vue.js and Ruy on his tool, iPipeTo."}},{"node":{"num":64,"title":"3D->2D, Websockets, oh my!","on":"20160614","speakers":[{"title":"Getting the most out of Sockets","name":"Frederic Charette","url":"fredericcharette@gmail.com","email":"fredericcharette@gmail.com","synopsis":"Sockets are light, powerful and all-around fun but they can be hard to work with. In this presentation we will visit socket communication concepts in Node.js and see how we can push performances to the limit with Kalm. We'll try out two demos: a micro-service implementation and a browser game integration that leverages websockets."},{"title":"Autopsy of an unconventional Javascript project","name":"Martin Vezina","url":"m.vezina@la-grange.ca","email":"m.vezina@la-grange.ca","synopsis":"This is the story of how a Javascript experiment became a t-shirt through a successful Kickstarter. I will describe what I went through to make this very unusual project, which involves a lot of different things from Three.js, Adobe Illustrator scripting, vector drawing and manipulation through code, plus all the unforeseen difficulties and how I overcame them. Oh, and orbital mechanics."}],"blurb":"Frederic will tell us about all things websockets, and Martin will show us what it takes to go from 3D to 2D. Don't blink, or you'll miss it!"}},{"node":{"num":63,"title":"TestingCeption","on":"20160510","speakers":[{"title":"Mocking stuff, in a good way.","name":"Arnaud Buchholz","url":"arnaud.buchholz@gmail.com","email":"arnaud.buchholz@free.fr","synopsis":"In this talk, Arnaud will show us key parts of Sinon.JS, specifically introducing one of it's most useful parts, the sinon.spy() function."}],"blurb":"Join us for a training session with Arnaud Buchholz performing some magic with Sinon.JS."}},{"node":{"num":62,"title":"Modern JavaScript","on":"20160412","speakers":[{"title":"Star Citizen Starmap: A Journey through a WebGL project","name":"Benoit Beauséjour","url":"b@turbulent.ca","email":"b@turbulent.ca","synopsis":"In this lightning talk the team from Turbulent will go through the lessons learned building a large-scale WebGL project. Anecdotes, stack & tech choices, the good and the bad."}],"blurb":"Join us for a demonstartion of Turbulent's stunningly beautiful, explorable galactic world!"}},{"node":{"num":61,"title":"Open Source - Parse Server","on":"20160308","speakers":[{"title":"parse-server: Beyond Facebook","name":"Florent Vilmart","url":"http://github.com/flovilmart","email":"florent@flovilmart.com","synopsis":"Facebook has recently open-sourced Parse after shutting down the project. Undeterred, Florent will show us what we can do with it, how to deploy it and provide some pro tips."}],"blurb":"Spring is in the air, and parse-server is open source. Both of those things are awesome but we can't give a talk about spring."}},{"node":{"num":60,"title":"Reactive JavaScript","on":"20160209","speakers":[{"title":"Beyond React: Introducing Cycle.js","name":"Andy Maleh","url":"https://www.codementor.io/andymaleh","email":"andy.am@gmail.com","synopsis":"Cycle.js is a reactive RxJS/Virtual DOM based front-end library. Andy will provide a quick introduction to Cycle.js basics and philosophies, go through a tutorial of its concepts and demonstrate with some code examples. "}],"blurb":"You've heard the term <i>Reactive programming</i> before. Someone tried to explain it to you; you have no idea what they are talking about. You should come to this meetup."}},{"node":{"num":59,"title":"JavaScript Fundamentals: Prototypal Inheritance","on":"20160112","speakers":[{"title":"Fundamentals: Prototypal Inheritance","name":"Steve Venzerul","url":"http://js-montreal.org","email":"ckm2k1@gmail.com","synopsis":"Prototypal inheritance in JavaScript is one of those things that is difficult to understand as a beginner and tricky to master as an experienced programmer. Steve will expose all its secrets, including some of the new constructs introduced in ES6."}],"blurb":"To kick off the new year, we will be having the first part of a series of JavaScript Fundamentals presentations."}}]}},"pageContext":{"year":2016,"yearRegex":"/^2016/"}}