{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":11,"edges":[{"node":{"num":46,"title":"WebVR, brings you the holidays, in 3D!","on":"20141209","speakers":[{"title":"WebVR and Oculus Rift","name":"Marc Khoury","url":"http://www.kronos.com/","email":"khoury.marc@gmail.com","synopsis":"Virtual Reality is coming fast to the general public, with the Oculus Rift leading the charge. Together we'll look at what the Oculus Rift is, and how we can approach development for it. The WebVR API provided in Firefox and Chrome will allow us to bring VR to the web using JavaScript. In the presentation, we'll learn how to integrate VR support into a THREE.js scene so that you can start building your own VR apps"}],"blurb":"Join us this holiday season in exploring the link between VR hardware like Oculus Rift and the WebVR spec experimentally implemeted in Chrome and Firefox."}},{"node":{"num":45,"title":"Cold hands, Warm data","on":"20141111","speakers":[{"title":"BabelFrog, a Chrome Extension","name":"Alex Dergachev","url":"http://evolvingweb.ca","email":"alex@evolvingweb.ca","synopsis":"Alex Dergachev recently built a simple Chrome Extension called BabelFrog to help him learn languages. Alex will show us how he did this and follow up with a discussion about chrome extensions: What you can do with them, how to get started making one, and some tricks he figured out along the way."},{"title":"Retour: Pourquoi et comment les Web Components?","name":"Sacha Leprêtre","url":"https://twitter.com/sachalepretre","email":"sacha.lepretre@gmail.com","synopsis":"Les Web Components (W3C) sont très prometteurs pour le web et les outils tels que Polymer, X-tag et Brick nous permettent d'en bénéficier dès à présent.<br><br>Mais qui a-t-il derrière ces librairies?<br><br>Pour éclairer nos choix technologiques, Sacha fait un retour sur sa présentation de Juin passé, avec des mise à jours importantes."}],"blurb":"This month: Chrome extensions and Web Components. La présentation Web Components est une collaboration avec nos amis de <a href=\"http://gtugmontreal.blogspot.ca\">GDG Montreal</a>."}},{"node":{"num":44,"title":"Fall","on":"20141014","speakers":[{"title":"The Greensock Animations Platform","name":"Martin Vézina","url":"https://github.com/mgvez","email":"m.vezina@la-grange.ca","synopsis":"Greensock Animation Platform is an amazing library used to design high performance animations for the web. Its flexibility makes it possible to construct complex animation sequences and integrate them into your workflow with mimimum effort, and its simplicity bridges the gap between the motion designer and the programmer."}],"blurb":"Fall is here, it's time for sweaters, wooly socks, and warm cup of Javascript."}},{"node":{"num":43,"title":"Fall","on":"20140909","speakers":[{"title":"ECMAScript 6: The Next Generation","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"The ECMAScript 6 spec brings a host of new features and API goodies to our favourite language. This talk will explore some of the new language constructs and APIs being introduced into Javascript, and which development pains they're designed to alleviate. Lastly, we'll see how we can leverage the features of tomorrow, today!"}],"blurb":"Join us this Fall for a cool breeze of fresh Javascript and it's newly minted features."}},{"node":{"num":42,"title":"Summer","on":"20140708","speakers":[{"title":"React","name":"Daniel Roberts","url":"https://infoactive.co/","email":"danielrobertsdesign@gmail.com","synopsis":"React is a recently released library built at Facebook and Instagram that's making a lot of waves. Daniel will show you what you need to know to get started and illustrate how it can work alongside more traditional libraries such as Backbone."},{"title":"Happy Parsing","name":"Florent Vilmart","url":"https://github.com/flovilmart","email":"florent@icangowithout.com","synopsis":"Parse is a popular platform that greatly simplifies the backend side of web and mobile apps. Florent has been an active user for a while and will quickly get us up to speed on the basics and follow up with power tips and advanced usage."}],"blurb":"Summer is in the air, and there's nothing like a nice cold serving of Javascript to keep you cool."}},{"node":{"num":41,"title":"Summer","on":"20140610","speakers":[{"title":"Advanced web debugging tools","name":"Kevin Vicrey","url":"https://vickev.com","email":"kevin.vicrey@nexu.org","synopsis":"Web applications getting more and more complex, bugs and performance issues can be difficult to find out. Using breakpoints in the debugging tool is a first step, but in this talk, we will focus more on advanced features."},{"title":"Pourquoi et comment les Web Components?","name":"Sacha Leprêtre","url":"https://twitter.com/sachalepretre","email":"sacha.lepretre@gmail.com","synopsis":"Les Web Components (W3C) sont très prometteurs pour le web,les librairies/polyfills telle que Polymer, X-tag/ Brick nous permettent d'en bénéficier dés à présent.<br><br>Mais qui a-t-il derrière ces librairies?<br><br>Afin de nous éclairer sur des éventuels choix technologiques, Sacha va nous présenter les stratégies utilisées par celles-ci et nous donner un rapide aperçu sur Lïghtly la librairie qu'il a conçu."}],"blurb":"Summer is in the air, and there's nothing like a nice cold serving of Javascript to keep you cool."}},{"node":{"num":40,"title":"Spring","on":"20140513","speakers":[{"title":"Supercharge your workflow through frontend tooling","name":"Kasper Isager","url":"https://github.com/kasperisager","email":"kasperisager@gmail.com","synopsis":"Writing Javascript applications for the browser is often a chaotic and fragmented experience. With a vast selection of technology at our disposal, bringing it all together is often time consuming and prone to error. Dependency management, code optimization, and portability are all part of the constant struggle."},{"title":"Let's Talk About Angular","name":"Rodric Haddad","url":"https://twitter.com/rodyhaddad","email":"rody@rodyhaddad.com","synopsis":"With concepts like $scope, Dependency Injection and Directives, AngularJS isn't always a walk in the park for the regular JavaScript aficionado. Rodric will walk us through these concepts, along with live demos to showcase them, and a production app built on top of the framework to put it all together."}],"blurb":"This month, Kasper shows us some tooling tricks, and Rodric demystifies Angular."}},{"node":{"num":39,"title":"Winter","on":"20140311","speakers":[{"title":"Cat-DNS: a DNS server that resolves everything to cats","name":"Monica Dinculescu","url":"http://notwaldorf.github.io/posts/go-cat-dns-go/","email":"mdinculescu@gmail.com","synopsis":"The internet needs more cats. DNS servers are the authority on all things internet. Therefore, the best DNS server is the one that resolves everything to cats. We'll talk about DNS servers: how they work, how your browser talks to them, and how to write a DNS server that always gives you a cat in less than 200 lines of JavaScript."},{"title":"D3 & FRB: A case study in binding and editable DataViz","name":"Gina Cook","url":"http://gina.ilanguage.ca/","email":"gina.c.cook@gmail.com","synopsis":"Functional Reactive Bindings go beyond just two-way data binding. They can gracefully bind long property paths and the contents of collections. They can also incrementally update the results of chains of queries including maps, flattened arrays, sums, and averages. In this talk I'll demo a framework agnostic graph visualization dashboard built using D3 and FRB which can be embedded in any client side app as a Bower component, or server side app as an NPM module."}],"blurb":"This month, we have cats! and Functional Reactive Bindings, which sadly have no cats involved, but are very interesting nonetheless."}},{"node":{"num":39,"title":"Spring","on":"20140408","speakers":[{"title":"Streaming the Internet of Things with Javascript.","name":"Ben Postlethwaite","url":"https://plot.ly","email":"ben@plot.ly","synopsis":"Javascript is everywhere and the maker movement is bringing affordable and hackable devices to a wider audience. At the same time Node provides us with a set of asynchronous primitives perfectly suited to wiring all of this together. Over the last few months this is exactly what we have been doing at Plotly. We want to share our experiences working with streams and real-time data in the server and client. We have some great demo's and projects so signup for Plotly and bring your laptops!"}],"blurb":"Spring brings us yet another snow storm and some beautiful streams and tools to keep our minds off the weather."}},{"node":{"num":38,"title":"Winter","on":"20140211","speakers":[{"title":"Front-End Web App Architecture","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"Front-end apps are all the rage nowadays and the tool chain has never been better, but what's behind all the magic? what makes a modern front-end JS app tick? We will be looking at all those questions and much more."}],"blurb":"This month we have a single session special event. etelesolv is providing the pizza and beer and Steve will bring food for thought on front-end app architecture."}},{"node":{"num":37,"title":"Winter","on":"20140114","speakers":[{"title":"Mise en lumière de votre JavaScript!","name":"Sebastien Cabot","url":"Missing","email":"sabascabot@gmail.com","synopsis":"Au cours de cette heure, nous souhaitons partager avec vous notre démarche pour parvenir à contrôler une bande DEL RVB via une interface Web, et cela en n'utilisant aucun autre langage que le JavaScript. Notre but est de vous initier à la quantité phénoménale d'interactions au monde physique qui vous est accessible avec la plateforme d'expérimentation BeagleBone Black et vos connaissances JavaScript."},{"title":"Turning Visual Studio into a NodeJS IDE","name":"Rami Sayar","url":"http://wootstudio.ca","email":"rami.sayar@microsoft.com","synopsis":"Rami Sayar is a Microsoft Technical Evangelist based in Montreal (@ramisayar). He will be demoing the latest tools for Node JS and Visual Studio. NTVS allows you develop and debug nodejs web apps while retaining all the IDE features and power of Visual Studio. You can manage NPM packages for your projects, perform remote debugging and more."}],"blurb":"Join us this month for some NodeJS goodness. Sebastien will show us a more in depth presentation on his Node powered hardware project and Rami will show us how to make Node development in Visual Studio more awesome."}}]}},"pageContext":{"year":2014,"yearRegex":"/^2014/"}}