{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":9,"edges":[{"node":{"num":16,"title":"More client-side MVCs","on":"20111108","speakers":[{"title":"Frameworks MVC JavaScript","name":"André de Santi Oliveira","url":"https://github.com/ASOBrasil","email":"asobrasil@gmail.com","synopsis":"Présentation des frameworks MVC JavaScript (SproutCore et JavascriptMVC) et l'écosystème autour d'eux (JavaScript frameworks, templates frameworks, dynamic stylesheet languages, mobile frameworks, etc)."},{"title":"A fresh new website (with nothing on it)","name":"Bruno Carriere","url":"http://js-montreal.org/","email":"neonskimmer@gmail.com","synopsis":"The JSMTL web site was getting a bit old so I decided to go ahead and begin a redesign. It uses Twitter's new baseline library, Bootstrap. All the code is available on Github and I want to invite everyone to play with it, because I suck at design."}],"blurb":"We had a lot of discussion and feedback following previous discussions on client-side MVC frameworks such as Backbone JS. More on this subject this month."}},{"node":{"num":15,"title":"JavaScript in your pocket","on":"20111011","speakers":[{"title":"State of jQuery Mobile","name":"Cedric Dugas","url":"http://www.position-absolute.com/","email":"cedric.dugas@cakemail.com","synopsis":"The jQuery mobile team has just released 1.0 RC1 nearly one year after its announcement and with it we are getting very close to a 1.0 release. Let's examine this framework and find out what makes it great as well as its weaknesses."},{"title":"Getting started with Sencha Touch","name":"Bruno Carriere","url":"http://js-montreal.org/","email":"neonskimmer@gmail.com","synopsis":"Sencha Touch is a mobile framework with a heavy emphasis on a hierarchy of widgets; much like its <a href='http://www.sencha.com/products/extjs/'>big brother</a> it is designed to be driven with a lot of JavaScript, and very little HTML."}],"blurb":"Mobile web applications are no longer the future, they're the present. There are a lot of tools out there to give you a headstart creating JavaScript mobile applications. This month we see two promising mobile frameworks."}},{"node":{"num":14,"title":"Userscripts, and state of JS-MONTREAL","on":"20110913","speakers":[{"title":"Userscripts: smoothing the creases of the web","name":"Mathias Baert","url":"https://twitter.com/mathiasbaert","email":"mathiasbaert@gmail.com","synopsis":"What to do when a website you frequent has these irksome little annoyances that drive you crazy? What to do when your browsing experience is repeatedly interupted by something that could be so much better if only they would fix it? Do you send the website owner an email asking to adapt his site to your tastes? No, you whip out greasemonkey and fix it with a userscript of course! Userscripts are old news. Still, I bet you're not using them quite enough. (Presentation in English)"},{"title":"State of the JS-MONTREAL address","name":"Bruno Carriere & Everyone else","url":"https://twitter.com/jsmontreal","email":"neonskimmer@gmail.com","synopsis":"We're quickly closing in on <em>two years</em> of JS-MONTREAL. Let's talk about what we want to see more of, less of and new things we want to accomplish over the next few months. Also we need halp! Are you interested in volunteering your time to make JS-MONTREAL better? It's a good time to get involved."}],"blurb":""}},{"node":{"num":13,"title":"Get organized","on":"20110809","speakers":[{"title":"jQuery Spaghetti, Version Sans Gras","name":"Cedric Dugas","url":"http://www.position-absolute.com/","email":"cedric_dugas@hotmail.com","synopsis":"Cedric nous démontre de simples trucs pour améliorer votre code tout en gardant la simplicité de jQuery intacte. Un entre deux pour ceux qui ne sont pas prêts à se lancer dans Backbone.js et autres frameworks plus complexes."},{"title":"Moving Planbox to Backbone.js: What we learned","name":"Martin Drapeau","url":"http://www.planbox.com/","email":"martin@planbox.com","synopsis":"<a href=\"http://planbox.com\">Planbox</a> is web-based Agile Project management tool. Project management can quickly become quite complex and Martin and his team have discovered that <a href=\"http://documentcloud.github.com/backbone\">Backbone.js</a> has really helped them keeping things simple. Come see how they moved the MVC stack to the forefront with Backbone. Learn about the benefits and downsides. Actually there are no downsides!"}],"blurb":"We all know how to write code. But what happens when the line count grows and new teammates join your project? You need structure. This month we have two presentations tackling this very subject. Cedric will present strategies for jQuery based projects of small to medium size. As for Martin, he will show us how they moved their web application codebase to a front-end centric architecture using Backbone.js."}},{"node":{"num":12,"title":"WebOS Intro, LiveTool: Peer to Peer in the browser","on":"20110712","speakers":[{"title":"LiveTool - Dessin dans le browser multi-utilisateur","name":"Olivier Arteau","url":"https://github.com/HoLyVieR/","email":"arteau.olivier@gmail.com","synopsis":"Olivier va nous présenter son application LiveTool qui permet à plusieurs personnes de travailler en même temps dans un éditeur graphique. Il nous présentera l'application, ainsi que les technologies utilisées dans ce projet."},{"title":"Developing for WebOS in Javascript - An Introduction","name":"Rahul Garg","url":"http://twitter.com/#!/codedivine","email":"rahulgarg44@gmail.com","synopsis":"Are you curious about WebOS? This tablet OS is designed from the ground up for JavaScript programmers. Rahul will present the OS and show how it works and give us an overview of the APIs and tools available."}],"blurb":""}},{"node":{"num":11,"title":"You look good in that script","on":"20110510","speakers":[{"title":"On CoffeeScript","name":"Derek Brans","url":"http://derekbrans.com/","email":"derek@derekbrans.com","synopsis":"CoffeeScript is a little language that compiles into JavaScript. Underneath all of those embarrassing braces and semicolons, JavaScript has always had a gorgeous object model at its heart. CoffeeScript is an attempt to expose the good parts of JavaScript in a simple way.  Derek's also going to talk about the IDE he's working on - built for CoffeeScript, in CoffeeScript on top of nodejs."},{"title":"Two Prototypal Eureka Moments","name":"Laurent Villeneuve","url":"http://laurentvilleneuve.com/","email":"mazesoul@gmail.com","synopsis":"Flash presentation about Laurent's new script, Super.js - a micro sized JS class implementation."}],"blurb":""}},{"node":{"num":10,"title":"Depeche Node","on":"20110412","speakers":[{"title":"Jump into Node: Building your first Node app with Connect & Express","name":"Christian Joudrey","url":"http://christianjoudrey.com/","email":"cmallette@gmail.com","synopsis":"Christian will show us how easy it is to get started with Node JS, creating a basic web application with Connect & Express."},{"title":"BDD with Jasmine","name":"Scott Burch","url":"http://scottburch.net/","email":"scott@bulldoginfo.com","synopsis":"Jasmine is an open-source BDD testing framework for Javascript.  After Scott's talk, you will not have any excuse not to unit test your JS. :D"}],"blurb":"Back from our March break with some excellent presentations. First off with <a href=\"http://christianjoudrey.com/\">Christian Joudrey</a> of <a href=\"http://cakemail.com\">Cakemail</a> who will show us how easy it is to get started with a typical web app project using Node JS, Connect & Express. Secondly a presentation by Scott Burch on Jasmine BDD, a testing framework for Javascript."}},{"node":{"num":9,"title":"The function object + Duck Hunt","on":"20110208","speakers":[{"title":"Don't skip chapter 7: A look at the Function object.","name":"Laurent Villeneuve","url":"http://js-montreal.org/","email":"mazesoul@gmail.com","synopsis":"The first time Laurent read \"Javascript, the Definitive Guide\" he skipped over chapter 7 entitled <b>Functions</b>. Bad idea. 8 years later, he won't let your make the same mistake."},{"title":"Canards & Canvas","name":"Vincent Renaudin","url":"http://js-montreal.org/","email":"vrenaudin@gmail.com","synopsis":"Vincent brave les avocats de Nintendo pour nous expliquer comment il a reproduit le classique de notre enfance \"Duck Hunt\" sur Canvas avec plusieures librairies utiles."}],"blurb":null}},{"node":{"num":8,"title":"Backbone.js, Part 1","on":"20110111","speakers":[{"title":"Building a client-side MVC app with Backbone.js, Underscore and jQuery","name":"Bruno Carriere","url":"http://js-montreal.org/","email":"neonskimmer@gmail.com","synopsis":"Backbone.js is a fresh new library providing models, collections, views and controllers to client-side JavaScript applications.  Bruno is going to take us through the creation of a simple but fully functional web app using Backbone."}],"blurb":null}}]}},"pageContext":{"year":2011,"yearRegex":"/^2011/"}}