{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":10,"edges":[{"node":{"num":58,"title":"Another year of JavaScript","on":"20151208","speakers":[{"title":"webtask.io","name":"Geoff Goodman","url":"https://twitter.com/filearts","email":"ggoodman@gmail.com","synopsis":"Imagine you could write powerful web applications without a backend, provisioning or deployment. Using only JavaScript. Geoff will explain some of the magic behind webtask.io and how you can use it today."},{"title":"This year in JavaScript","name":"Steve Venzerul & Bruno Carriere","url":"http://js-montreal.org/","email":"contact@js-montreal.org","synopsis":"Another crazy year gone by in the world of JavaScript. Join us as we go over the major trends for this year and our predictions for next year."}],"blurb":"'Server-less' webapps with webtask.io and our yearly retrospective."}},{"node":{"num":57,"title":"JavaScript & the Internet Of Things","on":"20151110","speakers":[{"title":"JavaScript & Physical Computing","name":"Jean-Philippe Côté","url":"http://tangiblejs.com/","email":"jp@cote.cc","synopsis":"Jean-Philippe will show us how easy it is for JavaScripters to write code that interacts with the physical world. Using NW.js and a Phidgets I/O board, we will break out of the virtual realm and gain access to the real, tangible world. Web developers will find that venturing outside the security of the browser sandbox can be quite a thrill…"}],"blurb":"<strong>We have moved!<br>This month, we will be meeting at <a href=\"https://garemtl.com/en/\">La Gare</a></strong><br><br>Our subject: JavaScript and the Internet of things. Just when you thought you were safe, JavaScript spreads its tentacles into your hardware. Doors open at 6pm."}},{"node":{"num":56,"title":"On React","on":"20151013","speakers":[{"title":"React & Flux","name":"Kevin Vicrey","url":"http://vickev.com/","email":"kevin.vicrey@nexu.org","synopsis":"<a href=\"https://facebook.github.io/react/\">React</a> and <a href=\"https://facebook.github.io/flux/\">Flux</a> are an open source library and architecture from Facebook to build web applications. Kevin will introduce these concepts and share his impressions, good and bad, after 6 months of use on a concrete project."},{"title":"Redux, Flux Evolved","name":"David Zhang","url":"http://github.com/gwwfps/","email":"gwwfps@gmail.com","synopsis":"Redux is a fresh new take on a Flux-like architecture for React-based applications. Like how React and the virtual DOM enabled easily building stateless view components, Redux brings the same convenience to the rest of your application. By managing application state in the framework, all of your code can be pure functions. As you'll see, when you do that, magic happens..."}],"blurb":"<strong>We have moved!<br>This month, we will be meeting at <a href=\"https://garemtl.com/en/\">La Gare</a></strong><br><br>Our subjects: React, Flux and Redux. Come early to hangout and meet our sponsor, AppDirect. Doors will open at 6pm."}},{"node":{"num":55,"title":"Goodbyes / Hellos","on":"20150908","speakers":[{"title":"Webpack is your friend","name":"Charles Ouellet","url":"https://twitter.com/couellet","email":"charles@snipcart.com","synopsis":"<a href='http://webpack.github.io/'>Webpack</a> is a module bundler that allows you to use multiple module definition systems, making refactoring of large scale single page applications much smoother. Charles will explain how to get started with Webpack, the main concepts behind the tool, and show us quick demos."},{"title":"TypeScript","name":"Marek Zaluski","url":"http://www.marekzaluski.com/","email":"marekz@gmail.com","synopsis":"TypeScript is an open source, typed superset of JavaScript. It is backed by Microsoft and usable everywhere JavaScript runs. Marek has been using it for a while and is going to tell us what he loves about it and how to get started."}],"blurb":"This will be our last meetup at the Radialpoint location. They have been amazing hosts. <strong>Thank you!</strong><br><br>This month: Package all the things with Webpack. Typed languages are more your type? Try TypeScript."}},{"node":{"num":54,"title":"It's all fun and games","on":"20150811","speakers":[{"title":"Using Phaser to build a music game","name":"Osman Zeki","url":"https://github.com/osmanzeki","email":"ozeki.media@gmail.com","synopsis":"In this talk Osman will discuss how his team used Phaser to develop a browser-based HTML5 Arcade/Music game that had to run on desktops and tablets. He'll describe the cross-browser compatibility, audio-visual synchronization and performance challenges they faced and give examples of how the engine's many features were used."},{"title":"Retro pixel games with ImpactJS","name":"Justin Stahlman","url":"http://www.stahlmandesign.com/","email":"jstahlman@mac.com","synopsis":"Justin has been wanting to make computer games since Space Invaders in 1982. That led him to teach himself game programming on the Apple II, then DOS, and eventually, years later, JavaScript. Retro pixel art and games are trendy again and he used the explosion of JS libraries and pixel-art nostalgia to remake some of the games of his youth -- and finally a new original game."}],"blurb":"This month is all about fun, as we dig into some cool frameworks used to build games in JavaScript. Get down with Osman Zeki and music games and take a trip through nostalgia land with Justin Stahlman."}},{"node":{"num":53,"title":"All things EcmaScript 6","on":"20150714","speakers":[{"title":"ES6: Diving Deeper","name":"Steve Venzerul","url":"https://github.com/ckm2k1","email":"ckm2k1@gmail.com","synopsis":"In my previous talk we saw an intro to new ES6 features, but everything was still in flux. Now that TC39 has finally approved the draft it's time to get a good feel for what's new and exciting in ES6. Additionaly we'll discuss the latest and greatest 'WebAssembly' and what it means for Javascript."}],"blurb":"This month: join us for a scooba dive in the newly approved ES6 features, WebAssembly, ASM.js and what all these buzz words mean for the web."}},{"node":{"num":52,"title":"RAML + Inker","on":"20150609","speakers":[{"title":"RAML: Describe your APIs","name":"Jonathan Stoikovich","url":"https://brandicted.com/","email":"jonathan@brandicted.com","synopsis":"RESTful API Modeling Language (RAML) is a simple and succinct way of describing practically-RESTful APIs. It encourages reuse, enables discovery and pattern-sharing, and aims for merit-based emergence of best practices. This presentation will demonstrate how to generate a JavaScript client from a RAML file and use that client in your projects."},{"title":"Inker: Rethinking how we manage email development & transactional delivery","name":"Cedric Dugas","url":"http://www.position-absolute.com","email":"cedric.dugas@gmail.com","synopsis":"Sujet difficile pour tout front-end dev, le développement d'email est souvent mal aimé et mépris. Voyons pourquoi nous sommes encore a faire des tables dans un monde ou les technologies front-end évolue rapidement et comment on peut améliorer ca de façons significative."}],"blurb":"This month: one more acronym you have to pretend to know about and a great new way to deal with email development without pulling your hair out."}},{"node":{"num":49,"title":"Javascript Spring Break","on":"20150310","speakers":[{"title":"Manipulating data structures with JavaScript data type's methods","name":"Sebastien Filion","url":"https://twitter.com/sebastienfilion","email":"sebastienfilion@me.com","synopsis":"Using JavaScripts data type's methods is a flexible way of manipulating data structures; Discover functional programing and how to make the most out these expressive techniques. After this talk you will be able to solve everyday problems elegantly."}],"blurb":"Join us this month for a nice dose of functional JS."}},{"node":{"num":48,"title":"Yeoman FTW","on":"20150210","speakers":[{"title":"Building you own Yeoman Generator","name":"Ruy Adorno","url":"https://twitter.com/ruyadorno","email":"ruyadorno@gmail.com","synopsis":"Generators are the building blocks of the Yeoman ecosystem and you don't need to be limited to only using the existing ones. In this talk we are going through an overview on how to create your own generator and automate your project setup process."},{"title":"Hands-on with Yeoman","name":"Rami Sayar","url":"http://twitter.com/ramisayar","email":"rami.sayar@microsoft.com","synopsis":"Yeoman is a tool designed for front-end web developers. It helps you start new projects right by providing a generator ecosystem. A generator helps define the scaffold for your projects and generators useful code for your starter project. In this talk, I will introduce you the Yeoman Workflow and the different tools, share my favorite generators."}],"blurb":"Join us this month for a great bit of automation with Yeoman. Automate all the things!"}},{"node":{"num":47,"title":"<a href=\"http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html\">Language of the year</a>","on":"20150113","speakers":[{"title":"Flexible declarative drag & drop for Angular","name":"Geoff Goodman","url":"https://twitter.com/filearts","email":"ggoodman@gmail.com","synopsis":"Geoff Goodman is the author and maintainer of Plunker. Facing particular UI challenges, he set out to create a directive that makes declarative drag & drop in Angular flexible and easy. He will tell us more about how it is built and the tools he used to create it."},{"title":"Pull the trigger on ES6 Modules","name":"Bruno Carriere","url":"https://twitter.com/jsmontreal","email":"neonskimmer@gmail.com","synopsis":"After years of turmoil and experimentation, JavaScript is set to have a proper module system in ES6. Bruno will show us how easy it is to take advantage of them today and present typical usage patterns."}],"blurb":"This month: A bit of Angular and a walk through ES6 modules. Our friends at etelesolv are back with beer and pizza, so come early! Doors open at 18:00."}}]}},"pageContext":{"year":2015,"yearRegex":"/^2015/"}}