{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":12,"edges":[{"node":{"num":83,"title":"Merry JavaScript to everyone!","on":"20171211","speakers":[{"title":"Down the SVG Rabbit Hole: Optimized Workflow and Advanced SVG Effects","name":"Robyn Larsen","url":"r@robynlarsen.ca","email":"r@robynlarsen.ca","synopsis":"We use Scalable Vector Graphics (SVGs) every day, but how well do we really understand it? More often than not, we are merely scratching the surface of a large and complicated discipline. Most developers and designers don’t realize how powerful and useful SVGs are, you will be surprised at how deep the rabbit hole goes. "},{"title":"JavaScipt: 2017","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"A quick discussion of what came and went in 2017. Frameworks, APIs, browsers, compilation targets. It's been a great year for JS and we'll take a last critical look at what we produced before moving on to another year."}],"blurb":""}},{"node":{"num":82,"title":"Headless, progressive Javascript. Like a Zombie.","on":"20171114","speakers":[{"title":"Unsupervised testing with Chrome Headless and Puppeteer","name":"Mats Ljunggren","url":"mats.ljunggren@boozang.com","email":"mats.ljunggren@boozang.com","synopsis":"Running unsupervised end-to-end testing in the browser is great for both monitoring and QA, and can save you tons of time and help you avoid bugs. Unfortunately, it used to require PhantomJS or browsers configured with virtual displays (like Xvfb) that made it fairly difficult and time-consuming. This has recently been made much simpler with Chrome supporting \"headless mode\", and with Google creating the npm package Puppeteer it is even simpler. Now the Chrome browser can be remotely controlled with just a few lines of Javascript code. I will show you some useful hands-on code examples."},{"title":"Introduction to Progressive Web Apps","name":"Sylvain Hamann","url":"sylvhama@gmail.com","email":"sylvhama@gmail.com","synopsis":"As we know, responsive web sites are no longer enough. We have to make sure it works offline, multiple devices, resolution, rendering capabilities and every other condition various browsing machines can throw at us nowadays. Sylvain will show us the dark art of turning your responsive website to a Progressive web app capable of the above."}],"blurb":"Testing with headless Chrome and Progressive web apps."}},{"node":{"num":81,"title":"Art imitating life","on":"20171010","speakers":[{"title":"Using JavaScript and other web technologies, to create a physical public art installation, that produce kindness and compassion.","name":"François Pliab","url":"francois@pliab.com","email":"francois@pliab.com","synopsis":"Utiliser l’écosystème JavaScript de façon créative pour donner vie à une « machine à bienveillance » : c’est l’expérience sociale qu’a réalisée Ensemble-Ensemble au métro St-Laurent à Montréal, transformant une place poussiéreuse et bétonnée en un lieu où des passants échangent, rient, se questionnent et discutent. Dans cette présentation il sera question des processus qui ont conduit à la création de cette installation interactive utilisant des technologies variées : electron, nodejs, es6, sass, kinect sdk, arduino, computer-vision, etc. Comment est-il possible de créer des interactions fortes et signifiantes avec le public en s’appuyant sur des technologies web?"}],"blurb":"Art and Javascript, sitting in a tree..."}},{"node":{"num":80,"title":"React'in","on":"20170913","speakers":[{"title":"React-Native intro and quirks","name":"Mathieu Legault","url":"mathieu.k.legault@gmail.com","email":"mathieu.k.legault@gmail.com","synopsis":"Introduction to react-native and overview of some topics you might encounter (Debug, Offline, FlexBox, Images, app size) while building an app."}],"blurb":"React Native brings Javascript goodies to the native app world. Let's explore how to get started with it."}},{"node":{"num":79,"title":"What are you on about Javascript??","on":"20170808","speakers":[{"title":"WTF JS -- Explained","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"An awesome list of Javascript quirks was recently posted to Github. Let's explore some of the weirdest and most confusing corners of JS while learning how they apply to real world examples."}],"blurb":"So we all know JS has some quirks, but can you tell why and how they come about? Let's ask the audience!"}},{"node":{"num":78,"title":"High Season","on":"20170711","speakers":[{"title":"Building a 3D Car Configurator using React, Flux and WebGL.","name":"Osman Zeki","url":"osman@zeki.ca","email":"osman@zeki.ca","synopsis":"Can React and Flux-like architectures be used to drive and manage a 3D world built with WebGL? With new tools and ideas emerging out of the worldwide open-source community, it certainly seems possible and it might even a good idea. In this talk, we will be going through how I built a real/commercial product using this premise, the tools that were used to do so and the lessons that were learned in the process. Here is a list of some of the subjects that the talk will cover : BabylonJS, InfernoJS / React, MobX / Flux, TypeScript, Webpack, Babel, Axios, SVG, Blender, SolidWorks, etc."},{"title":"Compactr, building lighter realtime applications","name":"Frederic Charette","url":"fredericcharette@gmail.com","email":"fredericcharette@gmail.com","synopsis":"Serialization is something that is often overlooked in the creation of realtime applications. Together we'll explore how serialization works, what protocols are out there and end with a live demo application."}],"blurb":"What do 3D cars and Compactr have in common? JS-Montreal of course."}},{"node":{"num":77,"title":"React and JS Conf EU Summary","on":"20170613","speakers":[{"title":"An Introduction to React Storybook","name":"Nick Taylor","url":"http://iamdeveloper.com/","email":"nick@iamdeveloper.com","synopsis":"ES6 has been making serious progress into our javascript lives. With that comes experience, bugs, stories, tips and tricks. I'll share some of my experience, bugs and tips encoutered while using ES6 in production on a medium to large application."},{"title":"[JS, CSS].Conf EU 2017","name":"Michael Sanford","url":"michaelsanford0@gmail.com","email":"michaelsanford0@gmail.com","synopsis":"I'll focus on the conferences report and give some insight into the new hotness-es for 2017, among them, preact, web assembly, and some just awesome things I learned with pointers to resources"}],"blurb":"The forecast for tonight, cool, cool javascript."}},{"node":{"num":76,"title":"React and JS Conf EU Summary","on":"20170613","speakers":[{"title":"An Introduction to React Storybook","name":"Nick Taylor","url":"http://iamdeveloper.com/","email":"nick@iamdeveloper.com","synopsis":"ES6 has been making serious progress into our javascript lives. With that comes experience, bugs, stories, tips and tricks. I'll share some of my experience, bugs and tips encoutered while using ES6 in production on a medium to large application."},{"title":"[JS, CSS].Conf EU 2017","name":"Michael Sanford","url":"michaelsanford0@gmail.com","email":"michaelsanford0@gmail.com","synopsis":"I'll focus on the conferences report and give some insight into the new hotness-es for 2017, among them, preact, web assembly, and some just awesome things I learned with pointers to resources"}],"blurb":"The forecast for tonight, cool, cool javascript."}},{"node":{"num":75,"title":"The Wild","on":"20170509","speakers":[{"title":"ES6 From the Wild: An Exploration","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"ES6 has been making serious progress into our javascript lives. With that comes experience, bugs, stories, tips and tricks. I'll share some of my experience, bugs and tips encoutered while using ES6 in production on a medium to large application."}],"blurb":"Is ES6 considered May flowers? Yes, we'll go with that."}},{"node":{"num":73,"title":"React and CPUs","on":"20170314","speakers":[{"title":"Demystifying CPU Profiling in Node.js","name":"Christophe Naud-Dulude","url":"christophe@busbud.com","email":"christophe@busbud.com","synopsis":"Node's event-driven and single threaded architecture enables easy concurrency and high throughput without much effort but comes at a cost. Synchronous and CPU intensive operations can lead to degraded performance and even completely block the process. CPU profiling allows developers to find blocking functions and deal with them accordingly. In this talk 'learn by example' talk, we'll look at some real issues that were identified and fixed thanks to CPU profiling."},{"title":"Building Universal JavaScript Applications with React","name":"Rami Sayar","url":"http://wootstudio.ca","email":"rami.sayar@microsoft.com","synopsis":"Rami will show us how to build universal, isomorphic JavaScript apps using React. We'll talk about strucutre, components, code sharing and other details of building robust JS code across front and back-ends."}],"blurb":"What do CPU profiling and React have in common? js-montreal of course."}},{"node":{"num":72,"title":"ES2017 and Beyond","on":"20170214","speakers":[{"title":"How Async/Await will change JavaScript forever","name":"Marek Zaluski","url":"marekz@gmail.com","email":"marekz@gmail.com","synopsis":"The async/await keywords are one of the most powerful upcoming ECMAScript feature. Let's learn how they work, how they relate to promises and generators, and why they're a game-changer for writing async code. And we'll review the key concepts about promises that you need to know to get a head start on using these new features."},{"title":"Debugging Javascript for fun and profit","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"A quick 15min talk about some cool techniques for debugging large projects in the Chrome DevTools console."}],"blurb":"JavaScript is the language of Love. It's love knows no types."}},{"node":{"num":71,"title":"The year of JavaScript","on":"20170110","speakers":[{"title":"From desktop to web app using Typescript","name":"Assane Gueye","url":"assane.gueye@ubisoft.com","email":"assane.gueye@ubisoft.com","synopsis":"Few years ago, we developed a collaborative tool in WPF intended for production teams. Sharing and communication of design intentions, missions, layout and structure of levels in the game world. That desktop app served as a beta to validate the need of such a system, and we agreed to go further with a web based version. A single page app with rich controls, aesthetic visuals and no more installation process. We decided to work with Typescript taking benefit, among other things, of its type checks, compilation time error detection, frequent updates and growing community. This talk will showcase our new product, its functionalities and our usage of multiple technologies with Typescript as a center point to reach our goal."}],"blurb":"Join us in opening 2017 with a fresh look at Typescript through the eyes of a Ubisoft framework."}}]}},"pageContext":{"year":2017,"yearRegex":"/^2017/"}}