{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":10,"edges":[{"node":{"num":36,"title":"Winter","on":"20131210","speakers":[{"title":"BrainBrowser","name":"Tarek Sherif","url":"http://www.tareksherif.ca/","email":"tsherif@gmail.com","synopsis":"BrainBrowser is a suite of web-based, real-time 2D and 3D visualization tools for neuroimaging data. BrainBrowser is a full JavaScript application, using WebGL (through three.js) for 3D rendering, the Canvas API for 2D rendering and Web Workers for computationally expensive data parsing tasks. It is being developed as part of the CBRAIN project at McGill University."},{"title":"jsOrrery - WebGL Solar System","name":"Martin Vézina","url":"http://www.linkedin.com/profile/view?id=41886384&authType=NAME_SEARCH&authToken=lN-6&locale=fr_FR&srchid=811941431386213808084&srchindex=1&srchtotal=20&trk=vsrp_people_res_name&trkInfo=VSRPsearchId%3A811941431386213808084%2CVSRPtargetId%3A41886384%2CVSRPcmpt%3Aprimary","email":"m.vezina@la-grange.ca","synopsis":"Experiments are not only fun to do, they are also a fantastic way to learn. I will walk you through an experimental project of mine : a visualization of the Solar System in 3D built with Three.js. So we will be talking about Three.js and WebGL but also physics, vector geometry, astronomy, etc. All of that in Javascript. Geek topics for a geek crowd!"}],"blurb":"Come explore the micro and the macro with these 2 beautiful WebGL/Three.js projects showcasing the human brain and the solar system"}},{"node":{"num":35,"title":"Autumn","on":"20131112","speakers":[{"title":"Framework Showdown","name":"Jason McCarrell","url":"http://www.linkedin.com/in/jasonmccarrell","email":"jason.abz@gmail.com","synopsis":"With so many Javascript frameworks and libraries it's hard to know which one works for which scenario. Luckily Jason has redundantly built the same project using three different libraries. This presentation will compare Angular, Backbone, and Meteor using a hands-on use case of a TCG visual deck builder."}],"blurb":"November brings us cold, rain and frameworks. Come for the Javascript, stay for the showdown!"}},{"node":{"num":34,"title":"Autumn","on":"20131008","speakers":[{"title":"Mozilla Persona","name":"Francois Marier","url":"https://login.persona.org","email":"francois@mozilla.com","synopsis":"Handling user passwords safely is hard, but replacing passwords on the web in a reasonable way is even harder. Really, this should have been in the browser all along. In this talk you we will see how Persona attempts to solve this issue."},{"title":"Building and Publishing Node.js Applications with Windows Azure Web Sites on OS X","name":"Rami Sayar","url":"http://wootstudio.ca","email":"rami.sayar@microsoft.com","synopsis":"In this talk, you will learn the basics of the Windows Azure Web Sites service for Node.js applications. You will see how to use the Windows Azure portal for creating a web site and then publish a \"Hello World\" Node.js application using Git. You will also learn how to use the Node.js Command-Line Tools for publishing applications. You will have an additional reason to use your free monthly Azure Credits!"}],"blurb":"This month we have 2 visiting giants. Francois from Mozilla is going to show us Persona, Mozilla's open auth system, and from Microsoft, Rami will show us how to leverage Windows Azure for Node.js applications."}},{"node":{"num":33,"title":"Autumn","on":"20130910","speakers":[{"title":"Plot.ly - D3 Magic","name":"Jack Parmer","url":"https://www.plot.ly","email":"jack@plot.ly","synopsis":"D3.js has steadily gained popularity among scientists, data journalists, and web developers and is now arguably the leading open-source tool for web visualization. This talk will discuss Plotly's integration of d3.js with UX controls that allow users greater control over vis styling and information presentation"},{"title":"PivotTable.js - For all your tabling needs","name":"Nicolas Kruchten","url":"https://github.com/nicolaskruchten/pivottable","email":"nicolas@kruchten.com","synopsis":"Pivot Tables and Pivot Charts are very useful interactive data analysis/visualization tools. Nicolas Kruchten from Datacratic will present his recently-open-sourced PivotTable.js component which addresses this need, and he will discuss applications and design decisions."}],"blurb":"Join us this month for 2 excellent talks about data-visualization and manipulation brought to you by Plotly and Nicolas' PivotTable."}},{"node":{"num":32,"title":"Summer","on":"20130813","speakers":[{"title":"RequireJS - Chargeur de Module AMD","name":"Thomas Thiery","url":"http://requirejs.org","email":"motahawk@gmail.com","synopsis":"RequireJS est une librairie qui permet de charger des fichiers et modules JavaScript. Elle facilite grandement la structuration des projets JavaScript. Par des exemples simples et concrets, la présentation nous amènera à voir plusieurs mises en place possibles de la librairie &mdash; shim, AMD, node &mdash; pour un rapide tour d'horizon."},{"title":"Browserify - CommonJS Module Loader","name":"Stanislav Venzerul","url":"http://browserify.org/","email":"ckm2k1@gmail.com","synopsis":"Browserify is a module management system and the main competitor to RequireJS. Unlike RequireJS, it's based on the CommonJS module loading system popularized by Node.js. This presentation will be an introduction to Browserify and how it differs from RequireJS and the AMD eco-system."}],"blurb":"Dependency and module management libraries are an important part of the JavaScript ecosystem and RequireJS and Browserify are the most popular solutions. Join us to learn what they can do for you."}},{"node":{"num":31,"title":"Summer","on":"20130709","speakers":[{"title":"Pump.io - Next-Gen Social Network Engine","name":"Ryan Weal","url":"http://www.kafei.ca/","email":"ryan@kafei.ca","synopsis":"Pump.io is a decentralized social network engine written in JavaScript. It lets you manage activity streams, handling protocol communication and providing a web UI with real-time updates. Ryan will explain how to join an existing pump.io instance and follow people on other instances, how pump.io’s protocols work, and show us how to setup your own pump.io server."},{"title":"Continuous Testing with Karma","name":"Daniel Roberts","url":"https://plus.google.com/102285204872951861022/posts","email":"danielrobertsdesign@gmail.com","synopsis":"Karma is a testing framework agnostic, blazingly fast automated test runner written by the Google team behind Angular.js. Karma listens to your filesystem and runs your tests every time you save a file. Daniel will cover how with Karma, writing tests first, before code, can speed up your day-to-day development process, and turn test writing from a chore to an essential time saving practice you couldn't live without."}],"blurb":"It's too hot to go play outside. Join us in Cakemail's comfortable, air-conditioned room for an evening of JavaScript."}},{"node":{"num":30,"title":"Spring","on":"20130611","speakers":[{"title":"Getting Started With Vanilla Mobile Apps","name":"Cedric Dugas","url":"http://www.position-absolute.com/","email":"cedric.dugas@gmail.com","synopsis":"Thinking about doing a mobile web app? See what issues you really don't want to tackle and learn some tips & tricks to get started."},{"title":"Grunt.js","name":"Rowan Udell","url":"http://dashboarddude.com/","email":"rowanu@gmail.com","synopsis":"A practical introduction to using the task runner GruntJS in your projects. More than just a build tool, Grunt makes it easy to automate your common tasks. Leverage concepts you already know, and an abundant ecosystem of plugins to quickly and easily improve your day-to-day workflow."}],"blurb":"Continuing our Spring session with more goodies. This month: Cedric will show us how to get started on mobile development, and Rowan will introduce Grunt.js for managing your builds and tasks in your awesome JS projects."}},{"node":{"num":29,"title":"Spring","on":"20130514","speakers":[{"title":"Continuous Testing with Karma","name":"Daniel Roberts","url":"http://ericminio.wordpress.com/","email":"danielrobertsdesign@gmail.com","synopsis":"Karma is a testing framework agnostic, blazingly fast automated test runner written by the Google team behind Angular.js. Karma listens to your filesystem and runs your tests every time you save a file. Daniel will cover how with Karma, writing tests first, before code, can speed up your day-to-day development process, and turn test writing from a chore to an essential time saving practice you couldn't live without."},{"title":"Hoodie","name":"Ben Neville","url":"http://blog.mainsocial.com/","email":"ben.nevile@gmail.com","synopsis":"Hoodie is a new \"frontend-only\" framework designed to help you build applications quickly without worrying about server-side programming. Ben is going to tell us about what it can do, what type of apps it's a good fit for, and show us how to get started."}],"blurb":"Spring is here and so are a bunch of new JavaScript tools. This month: Better testing with Karma and Front-end only web apps with Hoodie."}},{"node":{"num":28,"title":"JS-MONTREAL #28","on":"20130409","speakers":[{"title":"Un kata TDD en JavaScript: Prime Factors","name":"Eric Mignot","url":"http://ericminio.wordpress.com/","email":"eric.mignot@gmail.com","synopsis":"L'éco-système Javascript dispose aujourd'hui de tous les outils nécéssaires pour profiter du Développement piloté par les tests (TDD). Néanmoins sa maîtrise reste difficile. Les coding-dojos ont été conçus pour nous permettre d'apprendre à tirer le meilleur du TDD tout en jouant. Alors amenez vos laptops et venez coder, js-montreal se transforme en dojo!"},{"title":"Voxplode","name":"Maël Nison","url":"https://github.com/arcanis/","email":"nison.mael@gmail.com","synopsis":"Voxplode est un jeu qui se passe dans un monde genéré de façon procédurale, et rendu a l'aide d'un engin voxel. Mael va nous présenter son jeu et les outils qu'il a conçu pour y arriver."}],"blurb":"This month, coding kata practice and a Minecraft like game. Ce mois-ci, un kata JavaScript et un jeu de type Minecraft."}},{"node":{"num":27,"title":"Back in action","on":"20130312","speakers":[{"title":"Angular.js: Un survol","name":"Maël Nison","url":"https://github.com/arcanis","email":"nison.mael@gmail.com","synopsis":"Développé par Google, apportant un paradigme novateur, 'concurrent' direct d'Ember.js, AngularJS est un framework web faisant de parler de lui ces derniers temps. Maël nous présentera ses caractéristiques et points forts, avant d'évoquer quelques-uns des cas d'utilisations de l'outil."},{"title":"jQuery Promises en 15 minutes","name":"Maxime Bergeron","url":"https://github.com/maxmx","email":"maximeb@gmail.com","synopsis":"Malgré le fait qu'elles existent à travers les 'Deferred' dans jQuery depuis plusieurs versions (1.5+), les 'promises' sont encore méconnues et mal comprises par beaucoup de programmeurs. À travers plusieurs exemples, Maxime va démystifier tout ça."}],"blurb":"And we're back. With a lot of plans for the new year. De retour, avec plein de plans pour la nouvelle année."}}]}},"pageContext":{"year":2013,"yearRegex":"/^2013/"}}