{"data":{"tot":{"totalCount":90},"last":{"edges":[{"node":{"on":"20100121"}}]},"allMeetupsJson":{"totalCount":9,"edges":[{"node":{"num":92,"title":"Fall'in in love with Javascript","on":"20180911","speakers":[{"title":"No sugar please: a tearing down of abstractions","name":"David Demarais-Michaud","url":"desmarais.michaud.david@gmail.com","email":"desmarais.michaud.david@gmail.com","synopsis":"To demistify one of JS' hotest bits of syntax sugar and the familiar Promise, David will break down the mechanics of both async patterns by building his own naive variations of those language features."},{"title":"Développer une App Tablette, Desktop & Web avec React&React-Native","name":"Kim Reeves","url":"kreeves@turbulent.ca","email":"kreeves@turbulent.ca","synopsis":"The folks at Turbulent have been working hard using React and React-Native to bring quality, cross platform JS products to market. Today, they will show us the patterns, structures and challenges of building large scale cross platform apps."}],"blurb":"Syntax sugar and React-Native. Makes for excellent JS-Tea."}},{"node":{"num":91,"title":"Heat of Javascript","on":"20180814","speakers":[{"title":"Network optimizations 101","name":"Frederic Charette","url":"fredericcharette@gmail.com","email":"fredericcharette@gmail.com","synopsis":"If you have an application that requires network requests to run, you might want to come watch this presentation. We'll cover congestion control, caching, batching and a couple advanced strategies to make your application faster all while saving on infrastructure costs."},{"title":"Memoizing functions","name":"Ben Wiley","url":"therealbenwiley@gmail.com","email":"therealbenwiley@gmail.com","synopsis":"Ben will tell us all about the power of functional programming, specifically memoization and how it can help speed up frequently used side effect-less functions."}],"blurb":"All about the optimizations today. Memoization, network performance, lots of 'zations to go around."}},{"node":{"num":90,"title":"Summer of Javascript","on":"20180710","speakers":[{"title":"Async Generators - Looking at the ES2018 Spec","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"Building on Jason's talk from last meet-up, we'll look at Async Generators, a widely discussed feature documented in the new ES2018 spec. We'll look at some use cases and live examples."}],"blurb":"Generators, but... async this time."}},{"node":{"num":89,"title":"Get ready to generate!","on":"20180612","speakers":[{"title":"The Power of Generators","name":"Jason McCarrell","url":"jason.abz@gmail.com","email":"jason.abz@gmail.com","synopsis":"From abstracted testing to streaming data, generators provide a convenient framework for dealing with code step by step. We’ll look at why you should care about generators, how they work, when they should be used, and finally some fun things I’ve done with them."},{"title":"Prototype pollution attacks in NodeJS applications","name":"Olivier Arteau","url":"alexchalk17@gmail.com","email":"alexchalk17@gmail.com","synopsis":"Prototype pollution is a term that was coined many years ago in the JavaScript community to designate libraries that added extension methods to the prototype of base objects like \"Object\", \"String\" or \"Function\". This was very rapidly considered a bad practice as it introduced unexpected behavior in applications. In this presentation, we will analyze the problem of prototype pollution from a different angle. What if an attacker could pollute the prototype of the base object with his own value? What APIs allow such pollution? What can be done with it?"}],"blurb":"Genrators and security, a wonderful combination."}},{"node":{"num":88,"title":"Spring is in the air!","on":"20180508","speakers":[{"title":"Coding Strategy as a Rookie","name":"Alex Chalk","url":"alexchalk17@gmail.com","email":"alexchalk17@gmail.com","synopsis":"Alex will talk about ways to approach coding that have been (or would have been) useful to me when I was starting out. Hopefully it will give senior devs some good ideas on how to maximize the effectiveness of more junior team members"}],"blurb":"Spring is in the air, and little JavaScript flowers are blooming."}},{"node":{"num":87,"title":"Spring is in the air!","on":"20180410","speakers":[{"title":"Maintaining React Components","name":"Kevin Barabash","url":"kevinb7@gmail.com","email":"kevinb7@gmail.com","synopsis":"Kevin will show us how to use flow to facilitate changing a components props (renaming/deleting/changing type) and how to use aphrodite (CSS in JS library) with flow to control which styles can be passed to components."},{"title":"What's the difference between a Resolved, Settled, and Fulfilled promise in Javascript?","name":"Marek Zaluski","url":"http://www.marekzaluski.com/","email":"marekz@gmail.com","synopsis":"In this talk we try to resolve some important questions around Javascript promises. We'll settle the confusion once and for all, and fulfill our desire for better understanding."}],"blurb":"Time to shake the winter cobwebs and pour a nice cup of JavaScript to get the season going."}},{"node":{"num":86,"title":"Security, Web Workers, oh my!","on":"20180312","speakers":[{"title":"Secure Your Single Page Application With Auth0","name":"Joel Lord","url":"https://auth0.com/","email":"joel.lord@auth0.com","synopsis":"A quick demo that shows the attendees how to secure an SPA (could be React, Angular or VueJs) using Auth0. Can be adapted based on the time available for the presentation."},{"title":"Web Workers","name":"Quentin Sommer","url":"sommerquentin67@gmail.com","email":"sommerquentin67@gmail.com","synopsis":"Description coming shortly."}],"blurb":"JavaScript March'es on. I'll show myself out..."}},{"node":{"num":85,"title":"","on":"20180213","speakers":[{"title":"Modern Dev Setup","name":"Steve Venzerul","url":"ckm2k1@gmail.com","email":"ckm2k1@gmail.com","synopsis":"Tools, shortcuts, keyboards, shells, emacs, and the CapsLock keys. Let's look at a modern development setup for the web."}],"blurb":"We always talk about JS, but what about everything around it? The hammers, chisels and screwdrivers of programming? What about the little things that make dev easier, and more pleasant, less swear-y? Let's find out."}},{"node":{"num":84,"title":"And a Happy New Year","on":"20180109","speakers":[{"title":"Workbox - a tool for building a Progressive Web Application","name":"Kostyantyn Artemov","url":"k.artemov@gmail.com","email":"k.artemov@gmail.com","synopsis":"Workbox is a collection of libraries and build tools that make it easy to store your website’s files locally, on your users’ devices. If you want to focus on your website logic, leave creation of an optimal ServiceWorker with sophisticated caching strategies to the Workbox tool."}],"blurb":"It's a new year, and new challenges. One of the hardest is building stable, fast and interactive web apps. Join us for a demonstration."}}]}},"pageContext":{"year":2018,"yearRegex":"/^2018/"}}